<template>
  <div class="faq">

    <img src="../assets/img/prize-side-left.png" alt="" class="faq__left">
    <img src="../assets/img/100za5-text.png" alt="" class="faq__right">

    <div class="faq__container">
      <h3 class="faq__heading page-title">{{ $t('faq.heading') }}</h3>
      <p class="faq__subtitle">
        {{ $t('faq.subheading') }}
      </p>

      <div class="faq__list" v-if="$i18n.locale === 'ru'">

        <transition-group>

          <div class="faq__item"
               v-for="(q, i) in faqRU"
               :key="q.title"
               :class="{'faq__item--active' : q.show}"
          >

            <div class="faq__row" @click="toggleRU(i)">

              <div class="faq__title" v-html="q.title"></div>

              <svg class="faq__icon"
                   width="18px"
                   height="17px"
                   v-if="!q.show"
              >
                <use href="../assets/img/icons.svg#plus"></use>
              </svg>

              <svg class="faq__icon"
                   width="14px"
                   height="6px"
                   v-else
              >
                <use href="../assets/img/icons.svg#minus"></use>
              </svg>

            </div>

            <div class="faq__text" v-show="q.show" v-html="q.text"></div>

          </div>
        </transition-group>

      </div>

      <div class="faq__list" v-else>

        <transition-group>

          <div class="faq__item"
               v-for="(q, i) in faqKZ"
               :key="q.title"
               :class="{'faq__item--active' : q.show}"
          >

            <div class="faq__row" @click="toggleKZ(i)">

              <div class="faq__title" v-html="q.title"></div>

              <svg class="faq__icon"
                   width="18px"
                   height="17px"
                   v-if="!q.show"
              >
                <use href="../assets/img/icons.svg#plus"></use>
              </svg>

              <svg class="faq__icon"
                   width="14px"
                   height="6px"
                   v-else
              >
                <use href="../assets/img/icons.svg#minus"></use>
              </svg>

            </div>

            <div class="faq__text" v-show="q.show" v-html="q.text"></div>

          </div>
        </transition-group>

      </div>
    </div>
  </div>
</template>

<script>
export default {
  data() {
    return {
      faqRU: [
        {
          show: false,
          title: "Как оплатить членство в клубе 100ZA5?",
          text: "Ежемесячный взнос за членство в клубе выгодных покупок 100ZA5 оплачивается через приложение Bloomzed. Для этого необходимо: <span>1) скачать приложение Bloomzed;</span> <span>2) на сайте 100za5.kz в разделе «Оплатить взнос» ввести номер телефона или промокод, если таковой есть, и оплатить 1000 тенге через приложение Bloomzed. </span> <br> В приложении Bloomzed поступит счет на оплату, который вы сможете оплатить и стать участником клуба 100ZA5. <br> <br>Членство в клубе 100ZA5 дает возможность совершать выгодные покупки по акции 5% от стоимости товара или с 20% скидкой.",
        },
        {
          show: false,
          title: "Что даёт взнос в размере 1000 тг.?",
          text: "При оплате клубного взноса 100ZA5 появляется возможность участвовать в течении одного календарного месяца в рекламной акции. Акция проводится 10 раз в день. За данный взнос член клуба 100ZA5 получает возможность участвовать во всех акциях месяца.",
        },
        {
          show: false,
          title: "Как постоянно участвовать в рекламных акциях 100ZA5?",
          text: "Для участия в следующем месяце необходимо повторно оплатить клубный взнос в размере 1000 тг. в приложении Bloomzed.",
        },
        {
          show: false,
          title: "Как я узнаю о проведении рекламной акции?",
          text: "Информирование покупателя о проводимой рекламной акции осуществляется через Push-уведомления в приложении bloomzed со ссылкой на сайт с актуальным товаром.",
        },
        {
          show: false,
          title: "Как часто в рекламной акции будет участвовать автомобиль?",
          text: "Рекламная акция на автомобиль проходит раз в два месяца. Для того, чтобы стать участником акции на данный товар, необходимо оплачивать и участвовать в акциях в течение предыдущих двух месяцев.",
        },
        {
          show: false,
          title: "Как часто в рекламной акции будет участвовать квартира?",
          text: "Рекламная акция на квартиру проходит раз в три месяца. Для того, чтобы стать участником акции на данный товар, необходимо оплачивать и участвовать в акциях в течение предыдущих трех месяцев.",
        },
        {
          show: false,
          title: "Как получить товар?",
          text: "Чтобы получить ваш товар, необходимо: <br> <span>1) пройти полную идентификацию в приложении Bloomzed;</span> <span>2) получить счёт на оплату 5% от стоимости товара;</span> <span>3) оплатить счет;</span> <span>4) забрать товар у подрядчика.</span>",
        },
        {
          show: false,
          title: "Как производится доставка товара в Алматы?",
          text: "Доставка товара производится самостоятельно участником акции либо же по условиям подрядчика товара.",
        },
        {
          show: false,
          title: "Может ли получатель доверить получение товара третьему лицу?",
          text: "Да, получателем товара может быть другое физическое лицо. Для этого необходимо оповестить нас по контактному номеру и предоставить данные нового получателя.",
        },
        {
          show: false,
          title: "Есть ли доставка товара в другие регионы?",
          text: "Доставка в другие регионы производится на условиях поставщика товара.",
        },
      ],
      faqKZ: [
        {
          show: false,
          title: "Қалай төлеу керек?",
          text: "100ZA5 сауда клубына мүшелік үшін ай сайынғы төлем Bloomzed қосымшасы арқылы төленеді. Бұл қажет: <br> <span>1) Bloomzed қосымшасын жүктеп алыңыз;</span> <span>2) 100za5.kz веб-сайтындағы «Төлемді төлеу» бөліміне телефон нөмірін немесе егер бар болса, жарнамалық кодты енгізіп, Bloomzed қосымшасы арқылы 1000 теңге төлеңіз.</span> <br>Bloomzed қосымшасы төлем үшін шот-фактура алады, оны сіз төлей аласыз және 100ZA5 клубының мүшесі бола аласыз. <br> <br> 100ZA5 клубына мүшелік сізге тауарлар құнының 5% көтермелеп немесе 20% жеңілдікпен пайдалы сатып алулар жасауға мүмкіндік береді.",
        },
        {
          show: false,
          title: "1000тг үлесі қандай?",
          text: "Клуб ақысын төлеу арқылы бір айлық тауарлар жеңімпаздарын таңдауға қатысу мүмкіндігі туады. Мұндай тауарларды таңдау күніне 10 рет болады. Бұл төлем арқылы клуб мүшесі айдың барлық таңдауларына қатыса алады.",
        },
        {
          show: false,
          title: "Қалай қайта қатысушы бола аласыз?",
          text: "Келесі айда қатысуды жалғастыру үшін сіз 1000 теңге көлемінде клуб жарнасын төлеуіңіз керек. Bloomzed қосымшасында.",
        },
        {
          show: false,
          title: "Сатып алушының таңдауы және / немесе акция өткізіліп жатқанын қалай білуге болады?",
          text: "Сатып алушының таңдауы және / немесе жарнамалық акциялар бар сайтқа сілтемесі бар bloomzed қосымшасында Push хабарламалары арқылы жүзеге асырылады.",
        },
        {
          show: false,
          title: "Тауар таңдаламында автокөлік қаншалықты жиі таңдалады?",
          text: "Автокөлікке сатып алушының таңдалымы екі айда бір өтеді, осы тауарға қатысушы болу үшін сіз алдыңғы екі айдың жарнасын төлеуіңіз керек.",
        },
        {
          show: false,
          title: "Тауар таңдаламында пәтер қаншалықты жиі таңдалады? ",
          text: "Пәтерге сатып алушының таңдалымы үш айда бір өтеді, осы тауарға қатысушы болу үшін сіз алдыңғы үш айдың жарнасын төлеуіңіз керек.",
        },
        {
          show: false,
          title: "Тауарды қалай алуға болады?",
          text: "Өнімді алу үшін сізге: <br> <span>1) Bloomzed қосымшасында толық сәйкестендіруден өтуге;</span> <span>2) тауар құнынан 5% төлеу үшін шот-фактура алуға;</span> <span>3) шотты төлеуге;</span> <span>4) мердігерден тауарларды алуға.</span>",
        },
        {
          show: false,
          title: "Тауарлар қалай жеткізіледі? ",
          text: "Тауарларды жеткізуді таңдалым қатысушысының өзі немесе тауар мердігерінің шарттарына сәйкес жүзеге асырылады.",
        },
        {
          show: false,
          title: "Тауарды басқа адамға бере аламын ба? ",
          text: "Ия, тауарды алушы басқа жеке тұлға бола алады, ол үшін бізге байланыс нөмірі арқылы хабарлап, жаңа алушының деректерін көрсету қажет. ",
        },
        {
          show: false,
          title: "Басқа аймақтарға жеткізу бар ма? ",
          text: "Басқа аймақтарға жеткізу тауарларды жеткізушінің шарттарына сәйкес жүзеге асырылады.",
        },
      ],
    };
  },
  methods: {
    toggleRU(index) {
      this.faqRU[index].show = !this.faqRU[index].show;
      for (let i = 0; i < this.faqRU.length; i++) {
        if (this.faqRU[i] !== this.faqRU[index]) {
          this.faqRU[i].show = false;
        }
      }
    },
    toggleKZ(index) {
      this.faqKZ[index].show = !this.faqKZ[index].show;
      for (let i = 0; i < this.faqKZ.length; i++) {
        if (this.faqKZ[i] !== this.faqKZ[index]) {
          this.faqKZ[i].show = false;
        }
      }
    },
  }
};
</script>
