<template>
  <div class="faq">

    <img src="../assets/img/prize-side-left.png" alt="" class="faq__left">
    <img src="../assets/img/100za5-text.png" alt="" class="faq__right">

    <div class="faq__container">
      <h3 class="faq__heading page-title">
        Часто задаваемые вопросы
      </h3>
      <p class="faq__subtitle">
        Чтобы получить ответ, нажмите на нужный вопрос.
      </p>

      <div class="faq__list">

        <transition-group>

          <div class="faq__item"
               v-for="(q, i) in faq"
               :key="q.title"
               :class="{'faq__item--active' : q.show}"
          >

            <div class="faq__row" @click="toggle(i)">

              <div class="faq__title">
                {{ q.title }}
              </div>

              <svg class="faq__icon"
                   width="18px"
                   height="17px"
                   v-if="!q.show"
              >
                <use href="../assets/img/icons.svg#plus"></use>
              </svg>

              <svg class="faq__icon"
                   width="14px"
                   height="6px"
                   v-else
              >
                <use href="../assets/img/icons.svg#minus"></use>
              </svg>

            </div>

            <div class="faq__text" v-show="q.show">
              {{ q.text }}
            </div>

          </div>
        </transition-group>

      </div>
    </div>
  </div>
</template>

<script>
export default {
  data() {
    return {
      faq: [
        {
          show: false,
          title: "Как оплатить?",
          text: "Оплатить взнос за членство клуба выгодных покупок “100 за 5” можно через приложение Bloomzed. Необходимо скачать приложение, на сайте в разделе «Подтверждение участия» отсканировать через приложение QR код. По QR придет счет на оплату в приложении Bloomzed, который вы сможете оплатить и стать участником клуба.",
        },
        {
          show: false,
          title: "Что даёт взнос 1000тг.?",
          text: "При оплате клубного взноса, появляется возможность участвовать в течении одного календарного месяца в выборке победителей товаров. Выборка таких товаров производится 10 раз в день. Участник клуба может участвовать за данный взнос во всех выборках месяца.",
        },
        {
          show: false,
          title: "Как я узнаю о проведении выборки покупателя и/или акции?",
          text: "Информирование о проводимой выборке покупателя и/или рекламной акции осуществляется через Push уведомления в приложении bloomzed с ссылкой на сайт с актуальной акцией.",
        },
        {
          show: false,
          title: "Как повторно стать участником?",
          text: "Для возобновления участия на следующий месяц, необходимо также оплатить клубный взнос в размере 1000тг. в приложении Bloomzed.",
        },
        {
          show: false,
          title: "Как часто в выборке товаров будет участвовать автомобиль?",
          text: "Выборка покупателя на автомобиль проходит каждые два месяца, для того чтобы стать участником на данный товар, необходимо оплатить взнос за предыдущие два месяца.",
        },
        {
          show: false,
          title: "Как часто в выборке товаров будет участвовать квартира?",
          text: "Выборка покупателя на квартиру проходит каждые три месяца, для того чтобы стать участником на данный товар, необходимо оплатить взнос за предыдущие три месяца.",
        },
        {
          show: false,
          title: "Как получить товар?",
          text: "Чтобы получить товар, Вам необходимо пройти полную идентификацию в приложении Bloomzed, получить счёт на оплату 5% от стоимости товара, оплатить его и забрать у подрядчика товара.",
        },
        {
          show: false,
          title: "Есть ли доставка в другие регионы?",
          text: "Доставку в другие регионы производится на условиях поставщика товара.",
        },
        {
          show: false,
          title: "Как производится доставка товара?",
          text: "Доставка товара производится самостоятельно участником выборки либо же по условиям подрядчика товара.",
        },
        {
          show: false,
          title: "Могу ли я передать товар другому лицу?",
          text: "Да, получателем товара может быть другое физическое лицо, для этого необходимо оповестить нас по контактному номеру и предоставить данные нового получателя.",
        },
      ]
    };
  },
  methods: {
    toggle(index) {
      this.faq[index].show = !this.faq[index].show;
      for (let i = 0; i < this.faq.length; i++) {
        if (this.faq[i] !== this.faq[index]) {
          this.faq[i].show = false;
        }
      }
    }
  }
};
</script>
