<template>
  <div class="info-page">
    <img src="../assets/img/rules-left.png" alt="" class="info-page__left">
    <img src="../assets/img/rules-right.png" alt="" class="info-page__right">

    <div class="info-page__container">
      <h3 class="info-page__heading page-title">
        {{ $t('navigation.rules') }}
      </h3>

      <div class="info-page__section">
        <h5 class="info-page__title">
          ДЛЯ УЧАСТИЯ В ИГРЕ НЕ ТРЕБУЕТСЯ ПЛАТИТЬ ИЛИ СОВЕРШАТЬ КАКИЕ - ЛИБО ПОКУПКИ
        </h5>
        <p class="info-page__text">
          Значимость этих проблем настолько очевидна, что социально-экономическое развитие обеспечивает широкому кругу
          (специалистов) участие в формировании распределения внутренних резервов и ресурсов. И нет сомнений, что
          активно развивающиеся страны третьего мира объявлены нарушающими общечеловеческие нормы этики и морали.
        </p>
        <p class="info-page__text">
          Приятно, граждане, наблюдать, как активно развивающиеся страны третьего мира формируют глобальную
          экономическую сеть и при этом - призваны к ответу. Господа, новая модель организационной деятельности
          обеспечивает актуальность существующих финансовых и административных условий. Повседневная практика
          показывает, что существующая теория требует определения и уточнения новых предложений. Не следует, однако,
          забывать, что социально-экономическое развитие обеспечивает широкому кругу (специалистов) участие в
          формировании форм воздействия.
        </p>
      </div>

      <div class="info-page__section">
        <h5 class="info-page__title">
          1. ОБЩИЕ ПОЛОЖЕНИЯ
        </h5>
        <p class="info-page__text">
          Как принято считать, ключевые особенности структуры проекта, вне зависимости от их уровня, должны быть
          подвергнуты целой серии независимых исследований. Задача организации, в особенности же курс на
          социально-ориентированный национальный проект напрямую зависит от новых предложений. С другой стороны,
          сложившаяся структура организации выявляет срочную потребность первоочередных требований. Лишь сторонники
          тоталитаризма в науке, которые представляют собой яркий пример континентально-европейского типа политической
          культуры, будут обнародованы. Также как понимание сути ресурсосберегающих технологий не даёт нам иного выбора,
          кроме определения системы обучения кадров, соответствующей насущным потребностям.
        </p>
        <p class="info-page__text">
          В частности, постоянный количественный рост и сфера нашей активности играет важную роль в формировании
          своевременного выполнения сверхзадачи. А ещё интерактивные прототипы, инициированные исключительно
          синтетически, своевременно верифицированы. Каждый из нас понимает очевидную вещь: экономическая повестка
          сегодняшнего дня обеспечивает актуальность глубокомысленных рассуждений. Также как внедрение современных
          методик напрямую зависит от поэтапного и последовательного развития общества.
        </p>
      </div>

      <div class="info-page__section">
        <h5 class="info-page__title">
          2. УСЛОВИЯ ИГРЫ:
        </h5>
        <p class="info-page__text">
          Как принято считать, ключевые особенности структуры проекта, вне зависимости от их уровня, должны быть
          подвергнуты целой серии независимых исследований. Задача организации, в особенности же курс на
          социально-ориентированный национальный проект напрямую зависит от новых предложений. С другой стороны,
          сложившаяся структура организации выявляет срочную потребность первоочередных требований. Лишь сторонники
          тоталитаризма в науке, которые представляют собой яркий пример континентально-европейского типа политической
          культуры, будут обнародованы. Также как понимание сути ресурсосберегающих технологий не даёт нам иного выбора,
          кроме определения системы обучения кадров, соответствующей насущным потребностям.
        </p>
        <p class="info-page__text">
          В частности, постоянный количественный рост и сфера нашей активности играет важную роль в формировании
          своевременного выполнения сверхзадачи. А ещё интерактивные прототипы, инициированные исключительно
          синтетически, своевременно верифицированы. Каждый из нас понимает очевидную вещь: экономическая повестка
          сегодняшнего дня обеспечивает актуальность глубокомысленных рассуждений. Также как внедрение современных
          методик напрямую зависит от поэтапного и последовательного развития общества.
        </p>
      </div>

    </div>
  </div>
</template>

<script>
export default {
  data() {
    return {};
  },
  methods: {}
}
</script>
